---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.GetLengthUnitTypeId
source: html/e52e5896-ed08-c01a-c059-2e37ccb3e788.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.GetLengthUnitTypeId Method

Gets the identifier of the length unit quantifying the reinforcement rounding values.

## Syntax (C#)
```csharp
public ForgeTypeId GetLengthUnitTypeId()
```